Documents/ВходящийДокумент.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ВходящийДокумент</Name>
			<BasedOn>
				<xr:Item>Document.ИсходящийДокумент</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ОснованияОперацийСАктивамиСтраховыхКомпаний</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВходящегоДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВходящихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВходящегоДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРассмотрения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатРассмотрения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетОтветаПоСуществу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоЛицензииДУ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоЛицензииУКПИФ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоСобственнойДеятельностиУК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаВыплаты</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВходящихДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОтвета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйСотрудник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОбращения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВариантыОбращений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Уточнить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПолучения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыПолученияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Операции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Операция</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Договоры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Основания</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Основание</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ИсходящийДокумент</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/РаботаСДокументооборотомКлиент/Ext/Module.bsl
Процедура ПриИзмененииФлагаЛицензии(Объект, ИмяРеквизитаКлиент, ИмяРеквизитаЛицензии) Экспорт

	Если Объект[ИмяРеквизитаЛицензии] Тогда
		ПроверитьКорректностьФлаговЛицензий(Объект, ИмяРеквизитаКлиент, ИмяРеквизитаЛицензии);
	КонецЕсли;

КонецПроцедуры 

Процедура ПроверитьКорректностьФлаговЛицензий(Объект, ИмяРеквизитаКлиент, ИмяРеквизитаЛицензии = "") Экспорт

	Если ТипЗнч(Объект[ИмяРеквизитаКлиент]) = Тип("СправочникСсылка.ЮрФизЛица")
		И (Объект.ПоЛицензииДУ Или Объект.ПоЛицензииУКПИФ) Тогда
	
		СтруктураЛицензий = РаботаСДокументооборотом.ПолучитьДействующиеЛицензииПоДоговорамКлиента(Объект.Дата, Объект.Организация, Объект[ИмяРеквизитаКлиент]);
		
		Если ИмяРеквизитаЛицензии = "" Тогда // Проверяем все лицензии
		
			Для каждого Лицензия Из СтруктураЛицензий Цикл
				
				Если ТребуемаяЛицензияОтсутствует(Объект, Лицензия.Ключ, Лицензия.Значение) Тогда
				
					ЗадатьВопросОбновитьРеквизитПоЛицензии(Объект, Лицензия.Ключ);
				
				КонецЕсли;
				
			КонецЦикла;
			
		ИначеЕсли ТребуемаяЛицензияОтсутствует(Объект, ИмяРеквизитаЛицензии, СтруктураЛицензий[ИмяРеквизитаЛицензии]) Тогда
			ЗадатьВопросОбновитьРеквизитПоЛицензии(Объект, ИмяРеквизитаЛицензии);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТребуемаяЛицензияОтсутствует(Объект, ИмяРеквизитаЛицензии, НаличиеЛицензии)

	Возврат Объект[ИмяРеквизитаЛицензии] И Не НаличиеЛицензии;

КонецФункции 

Процедура ЗадатьВопросОбновитьРеквизитПоЛицензии(Объект, ИмяРеквизитаЛицензии)

	ТекстВопроса = "Отсутствуют действующие договоры по лицензии ";
	
	Если ИмяРеквизитаЛицензии = "ПоЛицензииУКПИФ" Тогда
		Подстрока = "УК ПИФ";
	ИначеЕсли ИмяРеквизитаЛицензии = "ПоЛицензииДУ" Тогда 
		Подстрока = "ДУ";
	КонецЕсли; 
	
	ТекстВопроса = ТекстВопроса + Подстрока + Символы.ПС + "Снять флаг?";
	
	Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
	
		Объект[ИмяРеквизитаЛицензии] = Ложь;
	
	КонецЕсли; 
	
КонецПроцедуры 

Процедура ОбработкаПереключенияТипаЮрФизЛицоСтрока(Форма, ИмяРеквизитаФормы, ИмяРеквизитаОбъекта, ОчиститьПараметрыВыбораДоговоров = Ложь) Экспорт

	Если Форма[ИмяРеквизитаФормы] = 1 Тогда
		
		Форма.Объект[ИмяРеквизитаОбъекта] = ПредопределенноеЗначение("Справочник.ЮрФизЛица.ПустаяСсылка");
		
	ИначеЕсли Форма[ИмяРеквизитаФормы] = 2 Тогда
		
		Форма.Объект[ИмяРеквизитаОбъекта] = "";
		
		Если ОчиститьПараметрыВыбораДоговоров И Форма.Элементы.Найти("ДоговорыДоговор") <> Неопределено Тогда
			Форма.Элементы.ДоговорыДоговор.ПараметрыВыбора = Новый ФиксированныйМассив(Новый Массив);
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры 

Процедура ПодборДоговоров(Форма, ЮрФизЛицо) Экспорт

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Период", НачалоДня(Форма.Объект.Дата));
	ПараметрыФормы.Вставить("ЮрФизЛицо", ЮрФизЛицо);
	ПараметрыФормы.Вставить("Организация", Форма.Объект.Организация);
	
	ОткрытьФормуМодально("Документ.ВходящийДокумент.Форма.ФормаВыбораДоговора", ПараметрыФормы, Форма.Элементы.Договоры);

КонецПроцедуры 

Процедура ДатаПриИзменении(Форма, ИмяРеквизитаКлиент = "") Экспорт

	Форма.Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Форма.Объект.Дата, Форма.Объект.Ссылка);
	
	Если Не Форма.ЭтоДокументДепозитарнойКомпании И НачалоДня(Форма.Объект.Дата) <> Форма.ИсходнаяДатаДокумента Тогда
		
		Форма.Объект.Номер = "";
		
		Если ЗначениеЗаполнено(ИмяРеквизитаКлиент) Тогда
		
			РаботаСДокументооборотомКлиентСервер.УстановитьПараметрыВыбораДоговора(Форма, ИмяРеквизитаКлиент);
		
		КонецЕсли; 		
		
	КонецЕсли; 

КонецПроцедуры

Процедура ДоговорыОбработкаВыбора(Форма, ВыбранноеЗначение) Экспорт 
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Массив") И ВыбранноеЗначение.Количество() > 0 Тогда
		
		Для каждого Структура Из ВыбранноеЗначение Цикл
			ЗаполнитьЗначенияСвойств(Форма.Объект.Договоры.Добавить(), Структура);
		КонецЦикла; 
		Форма.Модифицированность = Истина;
		РаботаСДокументооборотомКлиентСервер.ЗаполнитьЗаголовокГруппыДоговоров(Форма);
		
	КонецЕсли; 
	
КонецПроцедуры

Процедура СчетДоверительногоУправленияПриИзменении(Форма, ИмяРеквизитаКлиент) Экспорт
	
	Если Форма.Объект.Договоры.Количество() = 0 Тогда
		Форма.Объект.Договоры.Добавить();
	КонецЕсли; 
	Форма.Объект.Договоры[0].Договор = Форма.СчетДоверительногоУправления;
	
	Форма.Объект[ИмяРеквизитаКлиент] = РаботаСДокументооборотом.ПолучитьЮрФизЛицоДляСчетаДоверительногоУправления(Форма.СчетДоверительногоУправления);
	
КонецПроцедуры

Процедура ПроверитьЗаполнитьСодержаниеИсходящихДокументов(ИсходящиеДокументы, РежимЗаполнения) Экспорт

	ДокументыКЗаполнению = РаботаСДокументооборотом.ПолучитьИсходящиеДокументыБезСодержания(ИсходящиеДокументы);
	Если ДокументыКЗаполнению.Количество() = 1 Тогда
		ТекстВопроса = "В документе ";
	ИначеЕсли ДокументыКЗаполнению.Количество() > 1 Тогда 
		ТекстВопроса = "В документах ";
	Иначе
		ТекстВопроса = "";
	КонецЕсли; 
	
	Если ТекстВопроса <> "" Тогда
	
		ТекстВопроса = ТекстВопроса + СтрСоединить(ДокументыКЗаполнению, ", ") + " не заполнено содержание." + Символы.ПС + "Заполнить по шаблону?";
		
		Если Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
		
			РаботаСДокументооборотом.ЗаполнитьСтандартноеСодержаниеИсходящихДокументов(ДокументыКЗаполнению, РежимЗаполнения);
		
		КонецЕсли;

	КонецЕсли; 
	
КонецПроцедуры
